app/controllers/techs_controller.rb

  def create
    @tech = Tech.create(tech_params)
---
INSERT INTO "techs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Java"], ["created_at", "2018-07-10 19:15:52.825331"], ["updated_at", "2018-07-10 19:15:52.825331"]]

  def index
    @techs = Tech.all
---
SELECT "techs".* FROM "techs"

  def fetch_tech
    @tech = Tech.find(params[:id])
---
SELECT  "techs".* FROM "techs" WHERE "techs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]